Revit.GeometryConversion.DynamoToRevitBRep.ToRevitType(Autodesk.DesignScript.Geometry.Solid,System.Boolean,Autodesk.Revit.DB.ElementId)
this method attempts to construct a BRep from a closed solid.
sol:
performHostUnitConversion:
materialId:
Returns:

Revit.GeometryConversion.DynamoToRevitBRep.ToRevitType(Autodesk.DesignScript.Geometry.Surface,System.Boolean,Autodesk.Revit.DB.ElementId)
this method attempts to construct a BRep from a surface.
surf:
performHostUnitConversion:
materialId:
Returns: